convertigo-templates/lib_Salesforce/soap-templates/SoapBinding/CsendEmail.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:partner.soap.sforce.com">
   <soapenv:Header>
      <urn:CallOptions>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:client>$(HEADER_CALLOPTIONS_CLIENT)</urn:client>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:defaultNamespace>$(HEADER_CALLOPTIONS_DEFAULTNAMESPACE)</urn:defaultNamespace>
      </urn:CallOptions>
      <urn:SessionHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:sessionId>$(HEADER_SESSIONHEADER_SESSIONID)</urn:sessionId>
      </urn:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:sendEmail>
         <!--0 to 10 repetitions:-->
         <urn:messages>
            <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
            <urn:bccSender>$(BODY_SENDEMAIL_MESSAGES_BCCSENDER)</urn:bccSender>
            <!--type: {urn:partner.soap.sforce.com}EmailPriority - enumeration: [Highest,High,Normal,Low,Lowest]-->
            <urn:emailPriority>$(BODY_SENDEMAIL_MESSAGES_EMAILPRIORITY)</urn:emailPriority>
            <!--type: {http://www.w3.org/2001/XMLSchema}string-->
            <urn:replyTo>$(BODY_SENDEMAIL_MESSAGES_REPLYTO)</urn:replyTo>
            <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
            <urn:saveAsActivity>$(BODY_SENDEMAIL_MESSAGES_SAVEASACTIVITY)</urn:saveAsActivity>
            <!--type: {http://www.w3.org/2001/XMLSchema}string-->
            <urn:senderDisplayName>$(BODY_SENDEMAIL_MESSAGES_SENDERDISPLAYNAME)</urn:senderDisplayName>
            <!--type: {http://www.w3.org/2001/XMLSchema}string-->
            <urn:subject>$(BODY_SENDEMAIL_MESSAGES_SUBJECT)</urn:subject>
            <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
            <urn:useSignature>$(BODY_SENDEMAIL_MESSAGES_USESIGNATURE)</urn:useSignature>
         </urn:messages>
      </urn:sendEmail>
   </soapenv:Body>
</soapenv:Envelope>